[{"name":"Acton's dictum","quote":" \"Power tends to corrupt, and absolute power corrupts absolutely. Great men are almost always bad men [...]\""},{"name":"Alder's razor","quote":" See Newton's flaming laser sword below."},{"name":"Allen's rule","quote":" Endotherms from colder climates usually have shorter limbs (or appendages) than the equivalent animals from warmer climates."},{"name":"Amara's law","quote":" \"We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run.\" Named after Roy Amara (1925–2007)."},{"name":"The Asimov corollary to Parkinson's law","quote":" In ten hours a day you have time to fall twice as far behind your commitments as in five hours a day."},{"name":"Atwood's law","quote":" Any software that can be written in JavaScript will eventually be written in JavaScript."},{"name":"Avogadro's law, one of the gas laws, states that","quote":" \"equal volumes of all gases, at the same temperature and pressure, have the same number of molecules.\""},{"name":"Beer–Lambert law","quote":" in optics, the empirical relationship of the absorption of light to the properties of the material through which the light is traveling. Independently discovered (in various forms) by Pierre Bouguer in 1729, Johann Heinrich Lambert in 1760 and August Beer in 1852."},{"name":"Benford's law ","quote":" In many collections of data, a given data point has roughly a 30% chance of starting with the digit 1."},{"name":"Benford's law of controversy","quote":" Passion is inversely proportional to the amount of real information available."},{"name":"Bergmann's rule","quote":" within a broadly distributed taxonomic clade, populations and species of larger size are found in colder environments, and species of smaller size are found in warmer regions."},{"name":"Betteridge's law of headlines","quote":" \"any headline which ends in a question mark can be answered by the word 'no'\"."},{"name":"Brandolini's law","quote":" The amount of energy needed to refute bullshit is an order of magnitude bigger than to produce it. Named after Italian programmer Alberto Brandolini."},{"name":"Briffault's law","quote":" \"The female, not the male, determines all the conditions of the animal family. Where the female can derive no benefit from association with the male, no such association takes place.\" Named after Robert Briffault."},{"name":"Brooks's law","quote":" \"Adding manpower to a late software project makes it later.\" Named after Fred Brooks, author of the well known book on project management The Mythical Man-Month."},{"name":"Campbell's law","quote":" \"The more any quantitative social indicator is used for social decision making, the more subject it will be to corruption pressures and the more apt it will be to distort and corrupt the social processes it is intended to monitor.\"[1] Named after Donald T. Campbell (1916–1996)"},{"name":"Chargaff's rules state that DNA from any cell of all organisms should have a 1","quote":"1 ratio (base Pair Rule) of pyrimidine and purine bases and, more specifically, that the amount of guanine is equal to cytosine and the amount of adenine is equal to thymine. Discovered by Austrian chemist Erwin Chargaff."},{"name":"Cheops law","quote":" Nothing ever gets built on schedule or within budget."},{"name":"Claasen's law, or the logarithmic law of usefulness","quote":" usefulness = log(technology)."},{"name":"Conway's law","quote":" Any piece of software reflects the organizational structure that produced it. Named after Melvin Conway."},{"name":"Cooper's law","quote":" The number of radio frequency conversations which can be concurrently conducted in a given area doubles every 30 months."},{"name":"Cope's rule","quote":" Population lineages tend to increase in body size over evolutionary time."},{"name":"Cramer's rule","quote":" In linear algebra, an explicit formula for the solution of a system of linear equations with as many equations as unknowns, valid whenever the system has a unique solution. Named after Swiss mathematician Gabriel Cramer."},{"name":"Cunningham's law","quote":" The best way to get the right answer on the Internet is not to ask a question, but to post the wrong answer. Attributed to Ward Cunningham by Steven McGeady."},{"name":"Curie's law","quote":" In a paramagnetic material the magnetization of the material is (approximately) directly proportional to an applied magnetic field. Named after Pierre Curie."},{"name":"Curie-Weiss law","quote":" describes the magnetic susceptibility χ of a ferromagnet in the paramagnetic region above the Curie point. Named after Pierre Curie and Pierre-Ernest Weiss."},{"name":"D'Alembert's principle","quote":" The sum of the differences between the forces acting on a system of mass particles and the time derivatives of the momenta of the system itself along any virtual displacement consistent with the constraints of the system, is zero. Named after Jean le Rond d'Alembert."},{"name":"Dermott's law","quote":" The sidereal period of major satellites tends to follow a geometric series. Named after Stanley Dermott."},{"name":"Doctorow's law","quote":" \"Anytime someone puts a lock on something you own, against your wishes, and doesn't give you the key, they're not doing it for your benefit.\""},{"name":"Dollo's law","quote":" \"An organism is unable to return, even partially, to a previous stage already realized in the ranks of its ancestors.\" Simply put this law states that evolution is not reversible; the \"law\" is regarded as a generalisation as exceptions may exist.[2][3][4]"},{"name":"Duverger's law","quote":" Winner-take-all (or first-past-the-post) electoral systems tend to create a two-party system, while proportional representation tends to create a multiple-party system. Named for Maurice Duverger."},{"name":"Emmert's law, in optics","quote":" objects that generate retinal images of the same size will look different in physical size (linear size) if they appear to be located at different distances. Named for Emil Emmert."},{"name":"Engelbart's law","quote":" \"The intrinsic rate of human performance is exponential.\""},{"name":"Euler's laws of motion","quote":" extends Newton's laws of motion for point particle to rigid body motion."},{"name":"Faraday's law of induction","quote":" a magnetic field changing in time creates a proportional electromotive force. Named for Michael Faraday, based on his work in 1831."},{"name":"Faraday's law of electrolysis","quote":" the mass of a substance produced at an electrode during electrolysis is proportional to the number of moles of electrons transferred at that electrode; again named for Michael Faraday."},{"name":"Faxén's law","quote":" In fluid dynamics, Faxén's laws relate a sphere's velocity and angular velocity to the forces, torque, stresslet and flow it experiences under low Reynolds number (creeping flow) conditions."},{"name":"Frege's principle","quote":" The meaning of a complex expression is determined by the meanings of its constituent expressions and the rules used to combine them."},{"name":"Gall's law","quote":" \"A complex system that works is invariably found to have evolved from a simple system that worked.\""},{"name":"Gause's law, in ecology, the competitive exclusion principle","quote":" \"complete competitors cannot coexist.\""},{"name":"Gay-Lussac's law","quote":" \"The pressure of a fixed mass and fixed volume of a gas is directly proportional to the gas's temperature.\""},{"name":"Gell-Mann amnesia effect","quote":" Believing newspaper articles outside one's area of expertise, even after acknowledging that neighboring articles in one's area of expertise are completely wrong."},{"name":"Gérson's law","quote":" \"An advantage should be taken in every situation, regardless of ethics.\""},{"name":"Gibrat's law","quote":" \"The size of a firm and its growth rate are independent.\""},{"name":"Gibson's law","quote":" \"For every PhD there is an equal and opposite PhD.\""},{"name":"Godwin's law, an adage in Internet culture","quote":" \"As an online discussion grows longer, the probability of a comparison involving Nazis or Hitler approaches one.\" Coined by Mike Godwin in 1990."},{"name":"Gompertz–Makeham law of mortality","quote":" the death rate is the sum of an age-independent component and an age-dependent component."},{"name":"Goodhart's law","quote":" When a measure becomes a target, it ceases to be a good measure."},{"name":"Graham's law, a gas law in physics","quote":" the average kinetic energy of the molecules of two samples of different gases at the same temperature is identical. It is named for Thomas Graham (1805–1869), who formulated it."},{"name":"Grassmann's law","quote":" A dissimilatory phonological process in Ancient Greek and Sanskrit which states that if an aspirated consonant is followed by another aspirated consonant in the next syllable, the first one loses the aspiration. Named after its discoverer Hermann Grassmann."},{"name":"Grassmann's law (optics), an empirical result about human color perception","quote":" that chromatic sensation can be described in terms of an effective stimulus consisting of linear combinations of different light colors."},{"name":"Greenspun's tenth rule","quote":" Any sufficiently complicated C or Fortran program contains an ad hoc, informally specified, bug-ridden, slow implementation of half of Common Lisp; coined by Philip Greenspun."},{"name":"Grosch's law","quote":" the economic value of computation increases with the square root of the increase in speed; that is, to do a calculation 10 times as cheaply you must do it 100 times as fast. Stated by Herb Grosch in 1965."},{"name":"Grotthuss–Draper law","quote":" only that light which is absorbed by a system can bring about a photochemical change. Named for Theodor Grotthuss and John William Draper."},{"name":"Gustafson's law (also known as Gustafson–Barsis's law) in computer engineering","quote":" any sufficiently large problem can be efficiently parallelized. Coined by John Gustafson in 1988."},{"name":"Hagen–Poiseuille law","quote":" a physical law that gives the pressure drop in an incompressible and Newtonian fluid in laminar flow flowing through a long cylindrical pipe of constant cross section. Named after Gotthilf Hagen and Jean Poiseuille."},{"name":"Hamilton's principle","quote":" the dynamics of a physical system is determined by a variational problem for a functional based on a single function, the Lagrangian, which contains all physical information concerning the system and the forces acting on it. Named after William Rowan Hamilton."},{"name":"Hebb's law","quote":" \"Neurons that fire together wire together.\""},{"name":"Heisenberg's uncertainty principle","quote":" one cannot measure values (with arbitrary precision) of certain conjugate quantities, which are pairs of observables of a single elementary particle. The most familiar of these pairs is position and momentum."},{"name":"Henry's law","quote":" The mass of a gas that dissolves in a definite volume of liquid is directly proportional to the pressure of the gas provided the gas does not react with the solvent."},{"name":"Hess's law, in physical chemistry","quote":" the total enthalpy change during the complete course of a reaction is the same whether the reaction is made in one step or in several steps."},{"name":"Hitchens's razor is an epistemological principle maintaining that the burden of evidence in a debate rests on the claim maker, and that the opponent can dismiss the claim if this burden is not met","quote":" \"That which can be asserted without evidence can be dismissed without evidence.\""},{"name":"Hofstadter's law","quote":" \"It always takes longer than you expect, even when you take into account Hofstadter's law\" (Douglas Hofstadter, Gödel, Escher, Bach, 1979)."},{"name":"Hooke's law","quote":" The tension on a spring or other elastic object is proportional to the displacement from the equilibrium. Frequently cited in Latin as \"Ut tensio sic vis.\" Named after Robert Hooke (1635–1703)."},{"name":"Hotelling's law in economics","quote":" Under some conditions, it is rational for competitors to make their products as nearly identical as possible."},{"name":"Hubble's law","quote":" Galaxies recede from an observer at a rate proportional to their distance to that observer. Formulated by Edwin Hubble in 1929."},{"name":"Hume's law, in meta-ethics","quote":" normative statements cannot be deduced exclusively from descriptive statements."},{"name":"Humphrey's law","quote":" conscious attention to a task normally performed automatically can impair its performance. Described by psychologist George Humphrey in 1923."},{"name":"Hutber's law","quote":" \"Improvement means deterioration.\" Coined by financial journalist Patrick Hutber."},{"name":"Jevons paradox","quote":" Increasing the efficiency with which a resource is used increases the usage of that resource. William Stanley Jevons"},{"name":"Joy's law in management","quote":" the principle that \"no matter who you are, most of the smartest people work for someone else\", attributed to Sun Microsystems co-founder Bill Joy."},{"name":"Kerckhoffs's principle of secure cryptography","quote":" A cryptosystem should be secure even if everything about the system, except the key, is public."},{"name":"Klaiber's law","quote":" the silicon wafer size will dictate the largest diameter of ultrapure water supply piping needed within a semiconductor wafer factory."},{"name":"Kluge's law","quote":" a sound law that purports to explain the origin of the Proto-Germanic long consonants. Named after Friedrich Kluge."},{"name":"Koomey's law","quote":" the energy of computation is halved every year and a half."},{"name":"Kopp's law","quote":" The molecular heat capacity of a solid compound is the sum of the atomic heat capacities of the elements composing it. Named for Hermann Franz Moritz Kopp."},{"name":"Korte's law","quote":" The greater the length of a path between two successively presented stimuli, the greater the stimulus onset asynchrony must be for an observer to perceive the two stimuli as a single moving object."},{"name":"Kranzberg's laws of technology","quote":" The first law states that technology is neither good nor bad; nor is it neutral."},{"name":"Kryder's law","quote":" on growth of density of magnetic disk storage, compared to Moore's law."},{"name":"Lamarck's theory of evolution has two laws","quote":" The first can be paraphrased as \"use it or lose it\". The second is the more famous law of soft inheritance."},{"name":"Landauer's principle","quote":" there is a minimum possible amount of energy required to change one bit of information, known as the Landauer limit."},{"name":"Leavitt's law","quote":" In astronomy, a period-luminosity relation linking the luminosity of pulsating variable stars with their pulsation period. Named for American astronomer Henrietta Swan Leavitt."},{"name":"Leibniz's law is a principle in metaphysics also known as the Identity of Indiscernibles. It states","quote":" \"If two objects have all their properties in common, then they are one and the same object.\""},{"name":"Lenz's law","quote":" An induced current is always in such a direction as to oppose the motion or change causing it. Named for Russian physicist Emil Lenz."},{"name":"Lem's Law","quote":" \"No one reads; if someone does read, he doesn't understand, if he understands, he immediately forgets.\""},{"name":"Lewis's law","quote":" The comments on any article about feminism justify feminism. Named for English journalist Helen Lewis."},{"name":"Lightwood's law","quote":" In medicine, states that bacterial infections will tend to localise while viral infections will tend to spread."},{"name":"Liebig's law of the minimum","quote":" The growth or distribution of a plant is dependent on the one environmental factor most critically in demand."},{"name":"Linus's law","quote":" \"Given enough eyeballs, all bugs are shallow.\" Named for Linus Torvalds."},{"name":"Little's law, in queuing theory","quote":" \"The average number of customers in a stable system (over some time interval) is equal to their average arrival rate, multiplied by their average time in the system.\" The law was named for John Little from results of experiments in 1961."},{"name":"Littlewood's law","quote":" individuals can expect miracles to happen to them, at the rate of about one per month. Coined by J. E. Littlewood, (1885–1977)."},{"name":"Madelung rule","quote":" the order in which atomic orbitals are filled according to the aufbau principle. Named for Erwin Madelung. Also known as the Janet rule or the Klechkowski rule (after Charles Janet or Vsevolod Klechkovsky)."},{"name":"Maes–Garreau law","quote":" most favorable predictions about future technology will fall around latest possible date they can come true and still remain in the lifetime of the person making the prediction."},{"name":"Metcalfe's law, in communications and network theory","quote":" the value of a system grows as approximately the square of the number of users of the system. Framed by Robert Metcalfe in the context of ethernet."},{"name":"Miller's law, in communication","quote":" \"To understand what another person is saying, you must assume that it is true and try to imagine what it could be true of.\" Named after George Armitage Miller."},{"name":"Mooers's law","quote":" \"An information retrieval system will tend not to be used whenever it is more painful and troublesome for a customer to have information than for him not to have it.\" An empirical observation made by American computer scientist Calvin Mooers in 1959."},{"name":"Muphry's law","quote":" \"If you write anything criticizing editing or proofreading, there will be a fault of some kind in what you have written.\" The name is a deliberate misspelling of \"Murphy's law\"."},{"name":"Murphy's law","quote":" \"Anything that can go wrong will go wrong.\" Ascribed to Edward A. Murphy, Jr."},{"name":"Navier–Stokes equations","quote":" In physics, these equations describe the motion of viscous fluid substances. Named after Claude-Louis Navier and George Gabriel Stokes."},{"name":"Newton's flaming laser sword, also known as Alder's razor","quote":" What cannot be settled by experiment is not worth debating."},{"name":"Newton's law of cooling","quote":" The rate of cooling (or heating) of a body due to convection is proportional to the difference between the body temperature and the ambient temperature."},{"name":"Nielsen's law","quote":" A high-end user's internet connection speed grows by 50% per year."},{"name":"Niven's laws","quote":" several aphorisms, including \"If the universe of discourse permits the possibility of time travel and of changing the past, then no time machine will be invented in that universe.\""},{"name":"Occam's razor","quote":" explanations should never multiply causes without necessity. (\"Entia non sunt multiplicanda praeter necessitatem.\") When two or more explanations are offered for a phenomenon, the simplest full explanation is preferable. Named after William of Ockham (c. 1285–1349)."},{"name":"Oddo–Harkins rule","quote":" elements with an even atomic number are more common than those with odd atomic number. Named after Giuseppe Oddo and William Draper Harkins."},{"name":"Ohm's law, in physics","quote":" the ratio of the potential difference (or voltage drop) between the ends of a conductor (and resistor) to the current flowing through it is a constant. Discovered by and named after Georg Simon Ohm (1789–1854)."},{"name":"Okun's law, in economics","quote":" when unemployment increases by 1%, the annual GDP decreases by 2%."},{"name":"Ostrom's law, in economics and property law","quote":" resource arrangements in practice can be represented in theory, such as arrangements of the commons or shared property."},{"name":"O'Sullivan's first law, in politics","quote":" \"All organizations that are not actually right-wing will over time become left-wing.\""},{"name":"Papert's principle","quote":" \"Some of the most crucial steps in mental growth are based not simply on acquiring new skills, but on acquiring new administrative ways to use what one already knows.\""},{"name":"Pareto principle","quote":" for many phenomena 80% of consequences stem from 20% of the causes. Named after Italian economist Vilfredo Pareto, but framed by management thinker Joseph M. Juran."},{"name":"Parkinson's law of triviality","quote":" \"The time spent on any agenda item will be in inverse proportion to the sum of money involved.\" Also due to C. Northcote Parkinson."},{"name":"Peltzman effect","quote":" Safety measures are offset by increased risk-taking.[5]"},{"name":"Peter principle","quote":" \"In a hierarchy, every employee tends to rise to his level of incompetence.\" Coined by Dr. Laurence J. Peter (1919–1990) in his book The Peter Principle. In his follow-up book, The Peter Prescription, he offered possible solutions to the problems his principle could cause."},{"name":"Poe's law (fundamentalism)","quote":" \"Without a winking smiley or other blatant display of humor, it is utterly impossible to parody a Creationist in such a way that someone won't mistake for the genuine article.\"[6] Although it originally referred to creationism, the scope later widened to any form of extremism or fundamentalism.[7]"},{"name":"Postel's law","quote":" Be conservative in what you do; be liberal in what you accept from others. Derived from RFC 761 (Transmission Control Protocol, 1980) in which Jon Postel summarized earlier communications of desired interoperability criteria for the Internet Protocol (cf. IEN 111)[8]"},{"name":"Pournelle's iron law of bureaucracy","quote":" \"In any bureaucracy, the people devoted to the benefit of the bureaucracy itself always get in control and those dedicated to the goals the bureaucracy is supposed to accomplish have less and less influence, and sometimes are eliminated entirely.\""},{"name":"Premack's principle","quote":" More probable behaviors will reinforce less probable behaviors. Named for David Premack (1925–2015)"},{"name":"Putt's corollary","quote":" Every technical hierarchy, in time, develops a competence inversion."},{"name":"Raoult's law, in chemistry","quote":" that the vapor pressure of mixed liquids is dependent on the vapor pressures of the individual liquids and the molar fraction of each present in solution."},{"name":"Rayleigh–Jeans law","quote":" attempts to describe the spectral radiance of electromagnetic radiation at all wavelengths from a black body at a given temperature through classical arguments. Named after John William Strutt (Lord Rayleigh) and James Jeans."},{"name":"Reed's law","quote":" the utility of large networks, particularly social networks, can scale exponentially with the size of the network. Asserted by David P. Reed."},{"name":"Reilly's law of retail gravitation","quote":" People generally patronize the largest mall in the area."},{"name":"Rent's rule","quote":" In computing logic, the relationship between the number of external signal connections to a logic block (i.e., the number of \"pins\") with the number of logic gates in the logic block. Named for IBM employee E. F. Rent."},{"name":"Ribot's law","quote":" In amnesia, more recent memories are most affected."},{"name":"Ricco's law","quote":" In human vision, the product of contrast and area is a constant for small targets below the resolution limit."},{"name":"Roemer's law","quote":" A hospital bed built is a bed filled."},{"name":"Rosenthal effect, also known as the Pygmalion effect","quote":" Higher expectations lead to an increase in performance, or low expectations lead to a decrease in performance. Named after Robert Rosenthal."},{"name":"Rothbard's law","quote":" Everyone specializes in his own area of weakness."},{"name":"Sagan standard","quote":" Extraordinary claims require extraordinary evidence."},{"name":"Saint-Venant's principle states","quote":" \"the difference between the effects of two different but statically equivalent loads becomes very small at sufficiently large distances from load.\" Named after Adhémar Jean Claude Barré de Saint-Venant."},{"name":"Sarnoff's law","quote":" The value of a broadcast network is proportional to the number of viewers."},{"name":"Say's law, attributed to economist Jean-Baptiste Say by economist John Maynard Keynes","quote":" \"supply creates its own demand\", i.e., if businesses produce more output in a free market economy, the wages and other payment for productive inputs will provide sufficient demand so that there is no general glut.[9]"},{"name":"Schneier's law","quote":" \"Any person can invent a security system so clever that she or he can't think of how to break it.\""},{"name":"Segal's law","quote":" \"A man with a watch knows what time it is. A man with two watches is never sure.\""},{"name":"Shermer's last law","quote":" \"Any sufficiently advanced extraterrestrial intelligence is indistinguishable from God\".[10] This is a corollary to Clarke's third law."},{"name":"Shirky principle","quote":" \"Institutions will try to preserve the problem to which they are the solution.\""},{"name":"Sod's law states","quote":" \"if something can go wrong, it will\" or \"the degree of failure is in direct proportion to the effort expended and to the need for success\"."},{"name":"Sowa's law of standards","quote":" \"Whenever a major organization develops a new system as an official standard for X, the primary result is the widespread adoption of some simpler system as a de facto standard for X.\"[12]"},{"name":"Spearman's hypothesis","quote":" The magnitudes of the black–white differences on tests of cognitive ability positively correlate with the tests' g-loading."},{"name":"Stang's law, in Proto-Indo-European phonology","quote":" when a word ends with a vowel followed by a laryngeal or a semivowel *y or *w followed by a nasal, the laryngeal or semivowel is dropped, with compensatory lengthening of a preceding vowel. Named after Norwegian linguist Christian Stang."},{"name":"Stark–Einstein law","quote":" every photon that is absorbed will cause a (primary) chemical or physical reaction. Named after Johannes Stark and Albert Einstein."},{"name":"Stefan–Boltzmann law","quote":" The total energy radiated per unit surface area of a black body in unit time is directly proportional to the fourth power of the black body's thermodynamic temperature. Named for Jožef Stefan (1835–1893) and Ludwig Boltzmann."},{"name":"Stein's law","quote":" If something cannot go on forever, it will stop. If a trend cannot go on forever, there is no need for action or a program to make it stop, much less to make it stop immediately; it will stop of its own accord."},{"name":"Stigler's law","quote":" No scientific discovery is named after its original discoverer. Named by statistician Stephen Stigler who attributes it to sociologist Robert K. Merton, making the law self-referential."},{"name":"Streisand effect","quote":" Any attempt to hide, remove, or censor a piece of information has the unintended consequence of publicizing the information more widely."},{"name":"Sturgeon's law","quote":" \"Ninety percent of everything is crud.\" Derived from a quote by science fiction author Theodore Sturgeon (1918–1985)."},{"name":"Sutton's law","quote":" \"Go where the money is.\" Often cited in medical schools to teach new doctors to spend resources where they are most likely to pay off. The law is named after bank robber Willie Sutton, who when asked why he robbed banks, is claimed to have answered \"Because that's where the money is.\""},{"name":"Swanson's law","quote":" solar cell prices fall 20% for every doubling of solar cell industry manufacturing capacity. The law is named after SunPower Corporation founder Richard Swanson."},{"name":"Szemerényi's law, in Proto-Indo-European phonology","quote":" word-final clusters of vowels (V), resonants (R) and either *s or *h2 are simplified by dropping the word-final fricative (*h2 was phonetically itself probably a back fricative), with compensatory lengthening of the preceding vowel. Named for Hungarian linguist Oswald Szemerényi."},{"name":"Teeter's law","quote":" \"The language of the family you know best always turns out to be the most archaic.\" A wry observation about the biases of historical linguists, explaining how different investigators can arrive at radically divergent conceptions of the proto-language of a family. Named after the American linguist Karl V. Teeter."},{"name":"Titius–Bode law","quote":" \"a hypothesis that the bodies in some orbital systems, including the Sun's, orbit at semi-major axes in a function of planetary sequence\". Named for Johann Daniel Titius and Johann Elert Bode."},{"name":"Tobler's first law of geography","quote":" \"Everything is related to everything else, but near things are more related than distant things.\" Coined by Waldo R. Tobler (b. 1930)."},{"name":"Tullock Paradox","quote":" a rent-seeker wanting political favors can bribe politicians at a cost much lower than the value of the favor to the rent-seeker; named for American economist Gordon Tullock"},{"name":"Twyman's law","quote":"\"Any figure that looks interesting or different is usually wrong\", following the principle that \"the more unusual or interesting the data, the more likely they are to have been the result of an error of one kind or another\"."},{"name":"Van Loon's law","quote":" \"The amount of mechanical development will always be in inverse ratio to the number of slaves that happen to be at a country's disposal.\" Named for Hendrik Willem van Loon."},{"name":"Verdoorn's law, in economics","quote":" faster growth in output increases productivity due to increasing returns. Named after Dutch economist Petrus Johannes Verdoorn."},{"name":"Walras's law","quote":" budget constraints imply that the values of excess market demands must sum to zero."},{"name":"Wiio's laws","quote":" The fundamental Wiio's law states that \"Communication usually fails, except by accident\"."},{"name":"Wike's law of low odd primes","quote":" \"If the number of experimental treatments is a low odd prime number, then the experimental design is unbalanced and partially confounded.\"[13]"},{"name":"Winter's law","quote":" A sound law operating on Balto-Slavic short vowels. Named after Werner Winter"},{"name":"Wirth's law","quote":" Software gets slower more quickly than hardware gets faster."},{"name":"Wolff's law","quote":" Bone adapts to pressure, or a lack of it.[14]"},{"name":"Yao's principle, in computational complexity theory","quote":" the expected cost of any randomized algorithm for solving a given problem, on the worst case input for that algorithm, can be no better than the expected cost, for a worst-case random probability distribution on the inputs, of the deterministic algorithm that performs best against that distribution. Named for Andrew Yao."},{"name":"Zawinski's law","quote":" Every program attempts to expand until it can read mail. Those programs which cannot expand are replaced by ones which can."}]
